In [1]:
import pandas as pd

In [4]:
s = pd.Series([1,2,3,4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
s = pd.Series([1,2,3,4] , index =['A','B','C','D'])
s

A    1
B    2
C    3
D    4
dtype: int64

In [9]:
data =[
    [1,444,'ahmed'],
    [2,555,'ola'],
    [3,666,'fares'],
    [4,777,'habiba']
]
df = pd.DataFrame(data , columns= ['INDEX','STD_ID','Name'])
df

   INDEX  STD_ID    Name
0      1     444   ahmed
1      2     555     ola
2      3     666   fares
3      4     777  habiba

In [27]:
#dict
data ={
    'std1':[1,444,'ahmed'],
    'std2':[2,555,'ola'],
    'std3':[3,666,'fares'],
    'std4':[4,777,'habiba']
}
df = pd.DataFrame(data) 
df

    std1 std2   std3    std4
0      1    2      3       4
1    444  555    666     777
2  ahmed  ola  fares  habiba

In [28]:
data =[
    [1,444,'ahmed'],
    [2,555,'ola'],
    [3,666,'fares'],
    [4,777,'habiba']
]
display(df) # =dataFrame
cols = ['A','B','C','D']
df.columns =cols
display(df)
indx = ['indx','std_id','name']
df.index=indx
display(df)

    std1 std2   std3    std4
0      1    2      3       4
1    444  555    666     777
2  ahmed  ola  fares  habiba

       A    B      C       D
0      1    2      3       4
1    444  555    666     777
2  ahmed  ola  fares  habiba

            A    B      C       D
indx        1    2      3       4
std_id    444  555    666     777
name    ahmed  ola  fares  habiba

In [31]:
df.dtypes

A    object
B    object
C    object
D    object
dtype: object

In [54]:
data =[
    [1,1,'ahmed'],
    [2,3,'ola'],
    [3,5,'fares'],
    [4,100,'habiba']
]
df = pd.DataFrame(data , columns= ['INDEX','STD_ID','Name'])
df.dtypes

INDEX      int64
STD_ID     int64
Name      object
dtype: object

In [33]:
df['Name'].dtype

dtype('O')

In [34]:
df['STD_ID'] = df['STD_ID'].astype('category')
df.dtypes

INDEX        int64
STD_ID    category
Name        object
dtype: object

In [37]:
cols = ['INDEX','Name']
df[cols] = df[cols].astype('category')
df.dtypes

INDEX     category
STD_ID    category
Name      category
dtype: object

In [44]:
col = 'INDEX'
df[col] = df[col].astype('int64')
df.dtypes

INDEX        int64
STD_ID    category
Name      category
dtype: object

In [ ]:
## EDA - exploratory data analysis
#-> insights = keep the important features , drop the not , handling nulls , miising

In [ ]:
df.head(3) #first rows

   INDEX STD_ID   Name
0      1    444  ahmed
1      2    555    ola
2      3    666  fares

In [ ]:
df.tail(2) #last rows

   INDEX STD_ID    Name
2      3    666   fares
3      4    777  habiba

In [55]:
df.describe()

          INDEX      STD_ID
count  4.000000    4.000000
mean   2.500000   27.250000
std    1.290994   48.527484
min    1.000000    1.000000
25%    1.750000    2.500000
50%    2.500000    4.000000
75%    3.250000   28.750000
max    4.000000  100.000000

In [57]:
## info about cols
df.columns
##2
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   INDEX   4 non-null      int64
 1   STD_ID  4 non-null      int64
 2   Name    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [60]:
data =[
    [1,1,'ahmed'],
    [2,3,'ahmed'],
    [3,5,'habiba'],
    [4,100,'habiba']
]
df = pd.DataFrame(data , columns= ['INDEX','STD_ID','Name'])

In [61]:
df['Name'].unique()

array(['ahmed', 'habiba'], dtype=object)

In [62]:
df['Name'].unique().sum()

'ahmedhabiba'

In [64]:
df['INDEX'].min()

np.int64(1)

In [66]:
df['INDEX'].max()

np.int64(4)

In [67]:
df['STD_ID'].max()

np.int64(100)

In [75]:
df['STD_ID'].idxmax()

3

In [73]:
df['STD_ID'].value_counts()

STD_ID
1      1
3      1
5      1
100    1
Name: count, dtype: int64

In [74]:
df.max()

INDEX          4
STD_ID       100
Name      habiba
dtype: object

In [76]:
df['Name'].values

array(['ahmed', 'ahmed', 'habiba', 'habiba'], dtype=object)

In [ ]:
df.values # it sees this as an array

array([[1, 1, 'ahmed'],
       [2, 3, 'ahmed'],
       [3, 5, 'habiba'],
       [4, 100, 'habiba']], dtype=object)

In [78]:
df.replace('habiba','haneen')

   INDEX  STD_ID    Name
0      1       1   ahmed
1      2       3   ahmed
2      3       5  haneen
3      4     100  haneen

In [79]:
df.replace(100,7)

   INDEX  STD_ID    Name
0      1       1   ahmed
1      2       3   ahmed
2      3       5  habiba
3      4       7  habiba

In [ ]:
df.replace({4:'amir',1:'ayman'})

   INDEX STD_ID    Name
0  ayman  ayman   ahmed
1      2      3   ahmed
2      3      5  habiba
3   amir    100  habiba

In [83]:
##function everything u working on -> pipline

In [85]:
df.STD_ID.iloc[2]

np.int64(5)

In [86]:
df.STD_ID.iloc[2:1]

Series([], Name: STD_ID, dtype: int64)

In [87]:
df.STD_ID.iloc[0:2]

0    1
1    3
Name: STD_ID, dtype: int64

In [88]:
df.iloc[:,:]

   INDEX  STD_ID    Name
0      1       1   ahmed
1      2       3   ahmed
2      3       5  habiba
3      4     100  habiba

In [89]:
df.iloc[:,0:2]

   INDEX  STD_ID
0      1       1
1      2       3
2      3       5
3      4     100

In [95]:
x= df.iloc[:,:-1]
y= df.iloc[:,[0,1]]
y

   INDEX  STD_ID
0      1       1
1      2       3
2      3       5
3      4     100

In [104]:
new_cols = df.index + df.STD_ID
# df.insert(3,'New_cols',new_cols)
df

   INDEX  STD_ID    Name  New_cols  new_cols
0      1       1   ahmed         1         1
1      2       3   ahmed         4         4
2      3       5  habiba         7         7
3      4     100  habiba       103       103

In [ ]:
df.drop('new_cols',axis=1)  # axis = 0 => row , axis=1 => column

   INDEX  STD_ID    Name  New_cols
0      1       1   ahmed         1
1      2       3   ahmed         4
2      3       5  habiba         7
3      4     100  habiba       103

In [123]:
new_row = {'INDEX' : 6 , 'STD_ID':11 , 'Name':'OLLLa'}
df.loc[len(df)] = new_row
df

   INDEX  STD_ID    Name  New_cols  new_cols
0      1       1   ahmed       1.0       1.0
1      2       3   ahmed       4.0       4.0
2      3       5  habiba       7.0       7.0
3      4     100  habiba     103.0     103.0
4      5     100     ali       NaN       NaN
5      5     100     ali       NaN       NaN
6      5     100     ali       NaN       NaN
7      6      11   OLLLa       NaN       NaN

In [122]:
df.drop(6,axis=0)

   INDEX  STD_ID    Name  New_cols  new_cols
0      1       1   ahmed       1.0       1.0
1      2       3   ahmed       4.0       4.0
2      3       5  habiba       7.0       7.0
3      4     100  habiba     103.0     103.0
4      5     100     ali       NaN       NaN
5      5     100     ali       NaN       NaN